// Напишите программу, которая принимает на вход трёхзначное число и на выходе 
// показывает вторую цифру этого числа. Обращаться к числу как к строке нельзя.

// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.WriteLine("Введите число");
// int x = Convert.ToInt32( Console.ReadLine());

// int x1 = x / 10;
// int x2 = x1 / 10;
// int x3 = x1 % 10;

// Console.Write(x3);



// Напишите программу, которая выводит третью цифру заданного числа 
// или сообщает, что третьей цифры нет. Обращаться к числу как к строке нельзя.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

// Console.WriteLine("Введите число");
// int x = Convert.ToInt32( Console.ReadLine());
// int x1 = x / 100;
// int x2 = x % 100;
// int x3 = x2 % 10;

// if (x > 99 && x < 999)
// {
//     Console.WriteLine($"{x3}");
// }
//  else if(x>999)
// {
//     Console.WriteLine($"{(x/10)%10}");
// }
// else 
// {
//     Console.WriteLine($"{x} третьей цифры нет");
// }

// Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine (" Введите число от 1 до 7");
// int x = Convert.ToInt32 (Console.ReadLine());
// if (x>=1 && x<=5)
// {
//     Console.WriteLine("Нет, сегодня не выходной");
// }
// else if (x>5 && x<=7)
// {
//     Console.WriteLine("Да, сегодня выходной");
// }

//  else Console.WriteLine (" Некорректное число");




